"use client";

export default function Home() {
  return (
    <>
      <div>
        Уникальный способ тренировки английского языка. Большинство
        преподавателей сходятся во мнении, что для успешного владения английским
        языком нужно доведение до автоматизма граматических правил... Удобный
        фильтр, который поможет выбирать для тренировки необходимый набор
        предложений. Например, соменваетесь в том, как строятся вопросы в
        совершенном времени? Отфильтруйте предложения по этим критериям и
        оттачивайте это правило. Учите слова вместе с грамматикой. Заучивание
        слов может оказаться пустой тратой времени, ведь слова и их смысл лучше
        запоминаются в контексте. Принцип 20/80 - Парета. Составлен спицальный
        список самых частоиспользуемых слов в порядче частотности - от самых
        частых, к самым редким Выберите диапазон слов из списка NGSL 3000 и
        изучайте их вместе с грамматикой. Когда вы почувствуете, что оттачили
        эту группу слов, переходите к следующей меняя используемой
      </div>
    </>
  );
}
